Diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_Абонент</name>
    <comment>Необходим для возможности выбора договора вида: &quot;Абонентское обслуживание&quot;</comment>
  </enumValues>
</mdclass:Enum>

Diplom/src/CommonModules/ВКМ_ВспомогательныеФункцииКлиентСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция РеквизитыДоговораСтрокой(Номер, Дата, ВидДоговора) Экспорт
	
	Слова = Новый Массив;
	
	Если ЗначениеЗаполнено(ВидДоговора) Тогда
		Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Покупатель") Тогда
			Слова.Добавить("Договор продажи");
		ИначеЕсли ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Поставщик") Тогда
			Слова.Добавить("Договор поставки");
		ИначеЕсли ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_Абонент") Тогда
			Слова.Добавить("Абонентский договор");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номер) Тогда
		Слова.Добавить("№ " + СокрЛП(Номер));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Дата) Тогда
		Слова.Добавить(СтрШаблон(НСтр("ru = 'от %1 г.'"), Формат(Дата, "ДЛФ=D")));
	КонецЕсли;
	
	Возврат СтрСоединить(Слова, " ");
	
КонецФункции

#КонецОбласти
